[{"bookid": "0021",
   "name": "A Study in Scarlet",
   "author": "Arthur Conan Doyle",
   "price": 5.0,
   "imgpath":["https://raw.githubusercontent.com/qingsen01/front_end/main/Book/Mystery%2C%20Thriller%20%26%20Suspense/A%20Study%20in%20Scarlet/AStudyInScarlet.jpg"],
   "description": "In the debut of literature's most famous sleuth, a dead man is discovered in a bloodstained room in Brixton. The only clues are a wedding ring, a gold watch, a pocket edition of Boccaccio's Decameron, and a word scrawled in blood on the wall. With this investigation begins the partnership of Sherlock Holmes and Dr. Watson. Their search for the murderer uncovers a story of love and revenge-and heralds a franchise of detective mysteries starring the formidable Holmes.",
   "quantity": 8},
   {"bookid": "0022",
   "name": "Code Red",
   "author": "Vince Flynn and Kyle Mills",
   "price": 4.5,
   "imgpath":["https://raw.githubusercontent.com/qingsen01/front_end/main/Book/Mystery%2C%20Thriller%20%26%20Suspense/Code%20Red/51t6hdT70QL.jpg"],
   "description": "Mitch Rapp hates owing anyone a favor—especially when it's the world's most powerful crime lord. But when Damian Losa calls, Mitch is honor-bound to answer.<br>The Syrian government appears to have created a highly addictive new narcotic that it plans to distribute throughout Europe. It's a major threat to Losa's business and he's determined to send someone to keep him on top by any means necessary.<br>Rapp is the perfect choice for the mission. Not only does he have extensive experience operating in the Middle East, but he's also entirely expendable.<br>As he crosses into war-torn Syria, Rapp quickly discovers a shocking truth. The new drug isn't being produced by Damascus to prop up the government's collapsing finances. Instead, it was created by Russia's asymmetrical warfare unit, not for profit but as a weapon against the West.<br>With far more than Damian Losa's interests at stake, Rapp devises a desperate plan that forces him and his team onto a battlefield where the United States is virtually powerless and allegiances shift almost hourly. Further, if Russia uncovers their plot, it will set off a confrontation between the two countries that could change the course of human history.",
   "quantity": 5},
   {"bookid": "0023",
   "name": "Don't Let Her Stay",
   "author": "Nicola Sanders",
   "price": 5.5,
   "imgpath":["https://raw.githubusercontent.com/qingsen01/front_end/main/Book/Mystery%2C%20Thriller%20%26%20Suspense/Don't%20Let%20Her%20Stay/41WWXQ9OJiL.jpg"],
   "description": "It seemed only five minutes ago that Richard went to the station to pick up Chloe, and now they were here. I was so excited. Finally, I would meet my stepdaughter for the first time, and Chloe would meet her baby sister Evie.",
   "quantity": 4},
   {"bookid": "0024",
   "name": "Just Another Missing Person",
   "author": "Gillian McAllister",
   "price": 6.0,
   "imgpath":["https://raw.githubusercontent.com/qingsen01/front_end/main/Book/Mystery%2C%20Thriller%20%26%20Suspense/Just%20Another%20Missing%20Person/51KdlcpHIGL._SX329_BO1%2C204%2C203%2C200_.jpg"],
   "description": "Not everyone who is lost should be found…<br>22-year-old Olivia has been missing for one day…and counting. She was last seen on CCTV, entering a dead-end alley. And not coming back out again.<br>Julia, the detective heading up the search for Olivia, thinks she knows what to expect. A desperate family, a ticking clock, and long hours away from her husband and daughter. But she has no idea just how close to home this case is going to get.<br>Because the criminal at the heart of the disappearance has something she never expected. His weapon isn't a gun, or a knife: it's a secret. Her worst one. And her family's safety depends on one thing: Julia must NOT find out what happened to Olivia - and must frame somebody else for her murder.<br>If you find her, you will lose everything. What would you do?<br>This clever and endlessly surprising thriller is laced with a clever look at family and motherhood, and cements Gillian McAllister as a major talent in the world of suspense and a master of creating ethical dilemmas that show just how murky the distinction between right and wrong can be.",
   "quantity": 8},
   {"bookid": "0025",
   "name": "The Girl in Room 16",
   "author": "Eva Sparks",
   "price": 7.0,
   "imgpath":["https://raw.githubusercontent.com/qingsen01/front_end/main/Book/Mystery%2C%20Thriller%20%26%20Suspense/The%20Girl%20in%20Room%2016/411aPhsP3SL.jpg"],
   "description": "Eighteen years ago, FBI Agent Darcy Hunt's life changed forever when her little sister was abducted right under her nose—murdered by a crazed guild of misguided zealots.<br>Now, as she spends her days and nights hunting down the very worst of humanity, Darcy receives an unexpected call directing her to the sleepy small town of Miller’s Grove. Local law enforcement is unable to make sense of a chilling case, one that will prove to be the most complex and baffling of her career.<br>Small towns harbor big secrets, and as Darcy peels back the layers of Miller Grove's past, some of the residents start to get nervous. Never one to back down, Darcy must call on every bit of her training and experience as the investigation takes a sharp turn and forces her to confront a harrowing past she thought had finally let her go.<br>Meanwhile, someone lurks deep in the shadows, watching her, drawing her in closer and closer to the edge of truth that has lain hidden for all these years.<br>A puzzle slowly emerges, one that has taken years for a sick and twisted mind to carefully conceive, and it is only when a third girl goes missing that Darcy begins to realize that the grim events from her own past might be the only key to stopping an emboldened and fearless monster.",
   "quantity": 3},
   {"bookid": "0026",
   "name": "The Great Gatsby: Original 1925 Edition",
   "author": "F. Scott Fitzgerald",
   "price": 8.0,
   "imgpath":["https://raw.githubusercontent.com/qingsen01/front_end/main/Book/Mystery%2C%20Thriller%20%26%20Suspense/The%20Great%20Gatsby/41BiT3sOQBL._SX322_BO1%2C204%2C203%2C200_.jpg"],
   "description": "The Great Gatsby is considered F. Scott Fitzgerald's magnum opus, exploring themes of decadence, idealism, social stigmas, patriarchal norms, and the deleterious effects of unencumbered wealth in capitalistic society, set against the backdrop of the Jazz Age and the Roaring Twenties. At its heart, it's a cautionary tale, a revealing look into the darker side to the American Dream.",
   "quantity": 4},
   {"bookid": "0027",
   "name": "The House Across the Lake",
   "author": "Riley Sager",
   "price": 5.0,
   "imgpath":["https://raw.githubusercontent.com/qingsen01/front_end/main/Book/Mystery%2C%20Thriller%20%26%20Suspense/The%20House%20Across%20the%20Lake/51gX2HP%2BT5L._SX331_BO1%2C204%2C203%2C200_.jpg"],
   "description": "Casey Fletcher, a recently widowed actress trying to escape a streak of bad press, has retreated to the peace and quiet of her family's lake house in Vermont. Armed with a pair of binoculars and several bottles of bourbon, she passes the time watching Tom and Katherine Royce, the glamorous couple living in the house across the lake. They make for good viewing—a tech innovator, Tom is powerful; and a former model, Katherine is gorgeous.<br>One day on the lake, Casey saves Katherine from drowning, and the two strike up a budding friendship. But the more they get to know each other—and the longer Casey watches—it becomes clear that Katherine and Tom’s marriage isn't as perfect as it appears. When Katherine suddenly vanishes, Casey immediately suspects Tom of foul play. What she doesn't realize is that there's more to the story than meets the eye—and that shocking secrets can lurk beneath the most placid of surfaces.<br>Packed with sharp characters, psychological suspense, and gasp-worthy plot twists, Riley Sager's The House Across the Lake is the ultimate escapist read . . . no lake house required.",
   "quantity": 5},
   {"bookid": "0028",
   "name": "The Silent Patient",
   "author": "Alex Michaelides",
   "price": 4.5,
   "imgpath":["https://raw.githubusercontent.com/qingsen01/front_end/main/Book/Mystery%2C%20Thriller%20%26%20Suspense/The%20Silent%20Patient/41bsvxNUSdL.jpg"],
   "description": "The Silent Patient is a shocking psychological thriller of a woman's act of violence against her husband—and of the therapist obsessed with uncovering her motive.<br>Alicia Berenson's life is seemingly perfect. A famous painter married to an in-demand fashion photographer, she lives in a grand house with big windows overlooking a park in one of London's most desirable areas. One evening her husband Gabriel returns home late from a fashion shoot, and Alicia shoots him five times in the face, and then never speaks another word.<br>Alicia's refusal to talk, or give any kind of explanation, turns a domestic tragedy into something far grander, a mystery that captures the public imagination and casts Alicia into notoriety. The price of her art skyrockets, and she, the silent patient, is hidden away from the tabloids and spotlight at the Grove, a secure forensic unit in North London.<br>Theo Faber is a criminal psychotherapist who has waited a long time for the opportunity to work with Alicia. His determination to get her to talk and unravel the mystery of why she shot her husband takes him down a twisting path into his own motivations—a search for the truth that threatens to consume him....",
   "quantity": 8},
   {"bookid": "0029",
   "name": "The Southern Lawyer",
   "author": "Peter O'Mahoney",
   "price": 3.5,
   "imgpath":["https://raw.githubusercontent.com/qingsen01/front_end/main/Book/Mystery%2C%20Thriller%20%26%20Suspense/The%20Southern%20Lawyer/41VUAVG2HnL.jpg"],
   "description": "After more than twenty years away from the law, Joe Hennessy is forced back into the courtroom…<br>Trying to save his vineyard after years of drought, Hennessy returns to practice in the city he walked away from after the murder of his ten-year-old son—Charleston, South Carolina.<br>When one of South Carolina's most powerful men is charged with possessing stolen artwork, Hennessy steps forward to defend him. But as Hennessy digs into the evidence, as he navigates the truth, he finds that the criminal charges are only the start of their problems…<br>Despite his full workload, Hennessy takes on the defense of a young woman charged with stabbing her ex-boyfriend in a violent rage. As he prepares for the trial, Hennessy discovers there's more to the case than is presented by the prosecution…<br>As the cases twist and turn, Hennessy fights to prove that both clients are innocent. But to expose the truth, Hennessy must take one of the most dangerous risks of his life.<br>Can he ensure that justice triumphs? Or will the cases send him to an early grave?",
   "quantity": 7},
   {"bookid": "0030",
   "name": "Twenty Years Later",
   "author": "Charlie Donlea",
   "price": 4.0,
   "imgpath":["https://raw.githubusercontent.com/qingsen01/front_end/main/Book/Mystery%2C%20Thriller%20%26%20Suspense/Twenty%20Years%20Later/51eHhm0XRmL._SX337_BO1%2C204%2C203%2C200_.jpg"],
   "description": "Fans of Verity by Colleen Hoover won't want to miss this thrilling new suspense novel from the #1 internationally bestselling author of The Girl Who Was Taken! Hiding her own dark past in plain sight, a TV reporter is determined to uncover the truth behind a gruesome murder decades after the investigation was abandoned. But TWENTY YEARS LATER, to understand the present, you need to listen to the past…",
   "quantity": 8}
]