[{"bookid":"0001","name":"Assistant to the villain","author":"Hannah Nicole Maehre","price":3.5,"imgpath":["https://raw.githubusercontent.com/qingsen01/front_end/main/Book/Science%20Fiction%20%26%20Fantasy/Assistant-to-the-villain/assistant-to-the-villain.jpg","https://raw.githubusercontent.com/qingsen01/front_end/main/Book/Science%20Fiction%20%26%20Fantasy/Assistant-to-the-villain/Fr-8mxlaQAIn8Ru.jpg"],"description":"Once Upon a Time meets The Office in Hannah Maehrer’s laugh-out-loud viral TikTok series turned novel, about the sunshine assistant to an Evil Villain…and their unexpected romance.            ASSISTANT WANTED: Notorious, high-ranking villain seeks loyal, levelheaded assistant for unspecified office duties, supporting staff for random mayhem, terror, and other Dark Things In General. Discretion a must. Excellent benefits.            With ailing family to support, Evie Sage's employment status isn't just important, it's vital. So when a mishap with Rennedawn’s most infamous Villain results in a job offer—naturally, she says yes. No job is perfect, of course, but even less so when you develop a teeny crush on your terrifying, temperamental, and undeniably hot boss. Don’t find evil so attractive, Evie.            But just when she’s getting used to severed heads suspended from the ceiling and the odd squish of an errant eyeball beneath her heel, Evie suspects this dungeon has a huge rat…and not just the literal kind. Because something rotten is growing in the kingdom of Rennedawn, and someone wants to take the Villain—and his entire nefarious empire—out.            Now Evie must not only resist drooling over her boss but also figure out exactly who is sabotaging his work…and ensure he makes them pay.            After all, a good job is hard to find.","quantity":3},{"bookid":"0002","name":"Demon Copperhead: A Pulitzer Prize Winner","author":"Barbara Kingsolver","price":5.8,"imgpath":["https://raw.githubusercontent.com/qingsen01/front_end/main/Book/Science%20Fiction%20%26%20Fantasy/Demon%20Copperhead%20A%20Pulitzer%20Prize%20Winner/B09QMHZ53K.01._SCLZZZZZZZ_SX500_.jpg,https://raw.githubusercontent.com/qingsen01/front_end/main/Book/Science%20Fiction%20%26%20Fantasy/Demon%20Copperhead%20A%20Pulitzer%20Prize%20Winner/51rIAatrUCL._SX324_BO1%2C204%2C203%2C200_.jpg"],"description":"Demon Copperhead: A Pulitzer Prize Winner            WINNER OF THE 2023 PULITZER PRIZE • WINNER OF THE WOMEN'S PRIZE FOR FICTION            A New York Times \"Ten Best Books of 2022\" • An Oprah’s Book Club Selection • An Instant New York Times Bestseller • An Instant Wall Street Journal Bestseller • A #1 Washington Post Bestseller            \"Demon is a voice for the ages—akin to Huck Finn or Holden Caulfield—only even more resilient.” —Beth Macy, author of Dopesick            \"May be the best novel of 2022. . . . Equal parts hilarious and heartbreaking, this is the story of an irrepressible boy nobody wants, but readers will love.” (Ron Charles, Washington Post)            From the acclaimed author of The Poisonwood Bible and The Bean Trees, a brilliant novel that enthralls, compels, and captures the heart as it evokes a young hero’s unforgettable journey to maturity            Set in the mountains of southern Appalachia, Demon Copperhead is the story of a boy born to a teenaged single mother in a single-wide trailer, with no assets beyond his dead father’s good looks and copper-colored hair, a caustic wit, and a fierce talent for survival. Relayed in his own unsparing voice, Demon braves the modern perils of foster care, child labor, derelict schools, athletic success, addiction, disastrous loves, and crushing losses. Through all of it, he reckons with his own invisibility in a popular culture where even the superheroes have abandoned rural people in favor of cities.            Many generations ago, Charles Dickens wrote David Copperfield from his experience as a survivor of institutional poverty and its damages to children in his society. Those problems have yet to be solved in ours. Dickens is not a prerequisite for readers of this novel, but he provided its inspiration. In transposing a Victorian epic novel to the contemporary American South, Barbara Kingsolver enlists Dickens’ anger and compassion, and above all, his faith in the transformative powers of a good story. Demon Copperhead speaks for a new generation of lost boys, and all those born into beautiful, cursed places they can’t imagine leaving behind.","quantity":2},{"bookid":"0003","name":"From a Certain Point of View Return of the Jedi","author":"Olivie Blake, Saladin Ahmed, Charlie Jane Anders, Fran Wilde, Mary Kenney, Mike Chen","price":10.3,"imgpath":["https://raw.githubusercontent.com/qingsen01/front_end/main/Book/Science%20Fiction%20%26%20Fantasy/From%20a%20Certain%20Point%20of%20View%20Return%20of%20the%20Jedi/512jeDUHxaL.jpg"],"description":"From a Certain Point of View: Return of the Jedi (Star Wars)            Olivie Blake (Author), Saladin Ahmed (Author), Charlie Jane Anders (Author), Fran Wilde (Author), Mary Kenney (Author), & 11 more            Celebrate the lasting impact of Return of the Jedi with this exciting reimagining of the timeless Star Wars film featuring new perspectives from forty contributors.            On May 25, 1983, Star Wars cemented its legacy as the greatest movie franchise of all time with the release of Return of the Jedi. In honor of its fortieth anniversary, forty storytellers re-create an iconic scene from Return of the Jedi through the eyes of a supporting character, from heroes and villains to droids and creatures. From a Certain Point of View features contributions by bestselling authors and trendsetting artists:            Olivie Blake provides a chilling glimpse into the mind of Emperor Palpatine.            Saladin Ahmed recounts the tragic history of the rancor trainer.            Charlie Jane Anders explores the life and times of the Sarlacc.            Fran Wilde reveals Mon Mothma’s secret mission to save the Rebel Alliance.            Mary Kenney chronicles Wicket the Ewok’s quest for one quiet day on the forest moon of Endor.            Anakin Skywalker becomes one with the Force in a gripping tale by Mike Chen.            Plus more hilarious, heartbreaking, and astonishing tales from:            Tom Angleberger, K Arsenault Rivera, Kristin Baver, Akemi Dawn Bowman, Emma Mieko Candon, Olivia Chadha, Gloria Chao, Adam Christopher, Paul Crilley, Amal El-Mohtar, M. K. England, Jason Fry, Adam Lance Garcia, Lamar Giles, Max Gladstone, Thea Guanzon, Ali Hazelwood, Patricia A. Jackson, Alex Jennings, Jarrett J. Krosoczka, Sarah Kuhn, Danny Lore, Sarah Glenn Marsh, Kwame Mbalia, Marieke Nijkamp, Danielle Paige, Laura Pohl, Dana Schwartz, Tara Sim, Phil Szostak, Suzanne Walker, Hannah Whitten, Sean Williams, Alyssa Wong            To celebrate the launch of this book, Penguin Random House and Disney/Lucasfilm will each make donations to First Book—a leading nonprofit that provides new books, learning materials, and other essentials to educators and organizations serving children in need. In recognition of both companies’ longstanding relationships with First Book, Penguin Random House will donate at least $100,000 worth of booksto First Book and Disney/Lucasfilm will donate 100,000 children’s books to support First Book and their mission of providing equal access to quality education.            ","quantity":6},{"bookid":"0004","name":"Ghost Tamer","author":"Meredith R. Lyons","price":6.4,"imgpath":["https://raw.githubusercontent.com/qingsen01/front_end/main/Book/Science%20Fiction%20%26%20Fantasy/Ghost%20Tamer/51HMru-6YmL.jpg"],"description":"Death is one thing, it's what you do afterward that matters.            Aspiring-comedian Raely is the sole survivor of a disastrous train wreck. While faced with the intense grief of losing her best friend, she realizes that someone is following her—and has been following her all her life. Trouble is, no one else can see him. For a ghostly tag-along, Casper’s not so bad. He might even be the partner Raely needs to fight the evil spirit hell-bent on destroying her.            Raely and her friend must learn why this demonic spirit is haunting Raely and how she can stop him before he destroys her life—and her soul. Which, much to her chagrin, means she needs the help of a psychic (although she’s sure they are all charlatans) and must rid herself of the pesky ghost hunter who’s interested in exploiting her new abilities.            For readers who enjoy Leigh Bardugo’s Ninth House and Clay McLeod Chapman’s Ghost Eaters.","quantity":4},{"bookid":"0005","name":"Iron Flame (The Empyrean, 2)","author":"Rebecca Yarros","price":9.5,"imgpath":["https://raw.githubusercontent.com/qingsen01/front_end/main/Book/Science%20Fiction%20%26%20Fantasy/Iron%20Flame%20(The%20Empyrean%2C%202)/51CAWkTKfsL.jpg"],"description":"NOTE TO READERS: Preorder now and receive the stunning, LIMITED FIRST PRINT RUN―featuring spray-painted edges with gorgeously detailed map endpapers. This breathtaking first edition is only available for a limited time and while supplies last.            \"The first year is when some of us lose our lives. The second year is when the rest of us lose our humanity.\" ―Xaden Riorson            Everyone expected Violet Sorrengail to die during her first year at Basgiath War College―Violet included. But Threshing was only the first impossible test meant to weed out the weak-willed, the unworthy, and the unlucky.            Now the real training begins, and Violet’s already wondering how she’ll get through. It’s not just that it’s grueling and maliciously brutal, or even that it’s designed to stretch the riders’ capacity for pain beyond endurance. It’s the new vice commandant, who’s made it his personal mission to teach Violet exactly how powerless she is–unless she betrays the man she loves.            Although Violet’s body might be weaker and frailer than everyone else’s, she still has her wits―and a will of iron. And leadership is forgetting the most important lesson Basgiath has taught her: Dragon riders make their own rules.            But a determination to survive won’t be enough this year.            Because Violet knows the real secret hidden for centuries at Basgiath War College―and nothing, not even dragon fire, may be enough to save them in the end.            The Empyrean series is best enjoyed in order.","quantity":2},{"bookid":"0006","name":"The Butler's Ghost","author":"Robert Condry","price":12.5,"imgpath":["https://raw.githubusercontent.com/qingsen01/front_end/main/Book/Science%20Fiction%20%26%20Fantasy/The%20Butler's%20Ghost/61DnH4meCCL.jpg"],"description":"A successful businessman buys his dream house for himself and his family. He should have checked the attic - the man living up there has been there for 150 years.","quantity":3},{"bookid":"0007","name":"The Death I Gave Him","author":"Em X. Liu","price":9.5,"imgpath":["https://raw.githubusercontent.com/qingsen01/front_end/main/Book/Science%20Fiction%20%26%20Fantasy/The%20Death%20I%20Gave%20Him/51VJK9ddxNL.jpg"],"description":"A TWENTY-FIRST CENTURY HAMLET            Hayden Lichfield’s life is ripped apart when he finds his father murdered in their lab, and the camera logs erased. The killer can only have been after one thing: the Sisyphus Formula the two of them developed together, which might one day reverse death itself. Hoping to lure the killer into the open, Hayden steals the research. In the process, he uncovers a recording his father made in the days before his death, and a dying wish: Avenge me…            With the lab on lockdown, Hayden is trapped with four other people—his uncle Charles, lab technician Gabriel Rasmussen, research intern Felicia Xia and their head of security, Felicia’s father Paul—one of whom must be the killer. His only sure ally is the lab’s resident artificial intelligence, Horatio, who has been his dear friend and companion since its creation. With his world collapsing, Hayden must navigate the building’s secrets, uncover his father’s lies, and push the boundaries of sanity in the pursuit of revenge.","quantity":5},{"bookid":"0008","name":"The Navigating Fox","author":"Christopher Rowe","price":18.5,"imgpath":["https://raw.githubusercontent.com/qingsen01/front_end/main/Book/Science%20Fiction%20%26%20Fantasy/The%20Navigating%20Fox%20Kindle%20Edition/9781250804501.jpg"],"description":"The Navigating Fox is a fantastical fable of \"knowledgeable creatures\", in the vein of Brian Jacques's Redwall series but for adults, by Hugo and Nebula Award finalist Christopher Rowe            \"Half fable, half caper, and a pure joy to read.\"—Holly Black, New York Times bestselling author of Book of Night            \"There's nothing like it; you have to read it.\" —Alix E. Harrow, New York Times bestselling author of The Once and Future Witches            Quintus Shu'al, the world's only navigating fox, is in disgrace after guiding an expedition to its doom, leaving no survivors. One year later, Quintus is offered the chance to redeem himself: he will need to lead a motley, fractious team—both human and animal—all the way to the gates of Hell.            At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.","quantity":3},{"bookid":"0009","name":"The Phoenix King","author":"Aparna Verma","price":18.5,"imgpath":["https://raw.githubusercontent.com/qingsen01/front_end/main/Book/Science%20Fiction%20%26%20Fantasy/The%20Phoenix%20King/51-tEj6qVVL.jpg"],"description":"From a stunning new voice in science fantasy comes an action-packed debut of fire magic and ancient prophecy, in which the fate of a futuristic desert kingdom rests in the hands of a princess desperate for power and an assassin with a dark secret.            \"A CAPTIVATING ADVENTURE.\" —Peter V. Brett            The Ravani kingdom was born of a prophecy, carved from unforgiving desert sands and ruled by the Ravence bloodline: those with the power to command the Eternal Fire.            Elena Aadya is the heir to the throne—and the only Ravence who cannot wield her family’s legendary magic. As her coronation approaches, she will do whatever it takes to prove herself a worthy successor to her revered father. But she doesn’t anticipate the arrival of Yassen Knight, the notorious assassin who now claims fealty to the throne. Elena’s father might trust Yassen to be a member of her royal guard, but she is certain he is hiding something.             As the threat of war looms like a storm on the horizon, the two begin a dangerous dance of intrigue and betrayal. And the choices they make could burn down the world.            \"Come for the science fantasy worldbuilding and stay for the characters you just can’t get out of your head.” —Vaishnavi Patel, NYT bestselling author of Kaikeyi            \"Elegant and intelligent storytelling...an exhilarating adventure perfect for fans of S.A. Chakraborty.\" —Library Journal            \"A riveting page turner.\" —Booklist            \"This exciting fantasy promises good things from the series to come.\" —Publishers Weekly","quantity":5},{"bookid":"0010","name":"Willow of Ashes: Epic Fantasy","author":" Ellie Raine","price":18.5,"imgpath":["https://raw.githubusercontent.com/qingsen01/front_end/main/Book/Science%20Fiction%20%26%20Fantasy/Willow%20of%20Ashes%20Epic%20Fantasy/71%2BVIrT88jL._AC_UF1000%2C1000_QL80_.jpg"],"description":"\"If Tim Burton had written Lord of the Rings\" -̶̶̶ 1st PLACE WINNING FANTASY SERIES            The knights of Grim will pay any price to save a soul. But are their own souls worth that cost?            Born with split magic to raise the dead, honor-bound twin necromancers Xavier and Alexander are cursed by an ancient prophecy they can’t escape. To break their curse, they must venture to the five kingdoms and seek guidance from the world’s royals, which may reveal that there is more to the brothers’ halved magic than a mere arcane defect.            But with war breaking across the kingdoms, demons infesting the realms, and Death following them at every step, will the cure to the twin’s curse be worth the gruesome cost?            Ellie Raine has crafted an immersive world with magic like you’ve never seen before, and a hero and heroine for the ages – characters so sharply realized and so richly nuanced that this instant-classic will live on in hearts and minds for generations to come.            \"An incredible step into another world\" ̶̶̶ Writer’s Digest 1st Place Winning Fantasy            \"One of the most fascinating universes I have ever encountered\" ̶̶̶ Reader’s Favorite            \"A brilliantly scripted and entertainingly original fantasy saga\" ̶̶̶ Midwest Book Review            Award winning Epic Fantasy Series            First Place Writer's Digest 7th Annual Ebook award (Willow of Ashes)            Readers' Favorite international book award 2019 / 2020 (Willow of Ashes / Blossom of Gold)            Book Excellence Award Honoree 2021 / 2022 (Willow of Ashes / Pearl of Emerald)            Special Features            Action & Adventure            Elemental Soul-Bound magic            Epic battles            Gothic mystery            Extensive world-building            Immersive narration            Splash of Romance (Princess Bride level)            World Map included            Witty and morbid humor","quantity":5}]