[{"bookid":"0001","name":"Assistant to the villain","author":"Hannah Nicole Maehre","price":3.5,"imgpath":["https://raw.githubusercontent.com/qingsen01/front_end/main/Book/Science%20Fiction%20%26%20Fantasy/Assistant-to-the-villain/assistant-to-the-villain.jpg","https://raw.githubusercontent.com/qingsen01/front_end/main/Book/Science%20Fiction%20%26%20Fantasy/Assistant-to-the-villain/Fr-8mxlaQAIn8Ru.jpg"],"description":"Once Upon a Time meets The Office in Hannah Maehrer’s laugh-out-loud viral TikTok series turned novel, about the sunshine assistant to an Evil Villain...<br>and their unexpected romance.<br><br>ASSISTANT WANTED: Notorious, high-ranking villain seeks loyal, levelheaded assistant for unspecified office duties, supporting staff for random mayhem, terror, and other Dark Things In General. Discretion a must. Excellent benefits.<br><br>With ailing family to support, Evie Sage's employment status isn't just important, it's vital. So when a mishap with Rennedawn’s most infamous Villain results in a job offer—naturally, she says yes. No job is perfect, of course, but even less so when you develop a teeny crush on your terrifying, temperamental, and undeniably hot boss. Don’t find evil so attractive, Evie.<br><br>But just when she’s getting used to severed heads suspended from the ceiling and the odd squish of an errant eyeball beneath her heel, Evie suspects this dungeon has a huge rat...<br>and not just the literal kind. Because something rotten is growing in the kingdom of Rennedawn, and someone wants to take the Villain—and his entire nefarious empire—out.<br><br>Now Evie must not only resist drooling over her boss but also figure out exactly who is sabotaging his work...<br>and ensure he makes them pay.<br><br>After all, a good job is hard to find.","quantity":3},{"bookid":"0002","name":"Demon Copperhead: A Pulitzer Prize Winner","author":"Barbara Kingsolver","price":5.8,"imgpath":["https://raw.githubusercontent.com/qingsen01/front_end/main/Book/Science%20Fiction%20%26%20Fantasy/Demon%20Copperhead%20A%20Pulitzer%20Prize%20Winner/B09QMHZ53K.01._SCLZZZZZZZ_SX500_.jpg","https://raw.githubusercontent.com/qingsen01/front_end/main/Book/Science%20Fiction%20%26%20Fantasy/Demon%20Copperhead%20A%20Pulitzer%20Prize%20Winner/51rIAatrUCL._SX324_BO1%2C204%2C203%2C200_.jpg"],"description":"Demon Copperhead: A Pulitzer Prize Winner            WINNER OF THE 2023 PULITZER PRIZE • WINNER OF THE WOMEN'S PRIZE FOR FICTION            A New York Times \"Ten Best Books of 2022\" • An Oprah’s Book Club Selection • An Instant New York Times Bestseller • An Instant Wall Street Journal Bestseller • A #1 Washington Post Bestseller            \"Demon is a voice for the ages—akin to Huck Finn or Holden Caulfield—only even more resilient.” —Beth Macy, author of Dopesick            \"May be the best novel of 2022. . . . Equal parts hilarious and heartbreaking, this is the story of an irrepressible boy nobody wants, but readers will love.” (Ron Charles, Washington Post)            From the acclaimed author of The Poisonwood Bible and The Bean Trees, a brilliant novel that enthralls, compels, and captures the heart as it evokes a young hero’s unforgettable journey to maturity            Set in the mountains of southern Appalachia, Demon Copperhead is the story of a boy born to a teenaged single mother in a single-wide trailer, with no assets beyond his dead father’s good looks and copper-colored hair, a caustic wit, and a fierce talent for survival. Relayed in his own unsparing voice, Demon braves the modern perils of foster care, child labor, derelict schools, athletic success, addiction, disastrous loves, and crushing losses. Through all of it, he reckons with his own invisibility in a popular culture where even the superheroes have abandoned rural people in favor of cities.            Many generations ago, Charles Dickens wrote David Copperfield from his experience as a survivor of institutional poverty and its damages to children in his society. Those problems have yet to be solved in ours. Dickens is not a prerequisite for readers of this novel, but he provided its inspiration. In transposing a Victorian epic novel to the contemporary American South, Barbara Kingsolver enlists Dickens’ anger and compassion, and above all, his faith in the transformative powers of a good story. Demon Copperhead speaks for a new generation of lost boys, and all those born into beautiful, cursed places they can’t imagine leaving behind.","quantity":2},{"bookid":"0003","name":"From a Certain Point of View Return of the Jedi","author":"Olivie Blake, Saladin Ahmed, Charlie Jane Anders, Fran Wilde, Mary Kenney, Mike Chen","price":10.3,"imgpath":["https://raw.githubusercontent.com/qingsen01/front_end/main/Book/Science%20Fiction%20%26%20Fantasy/From%20a%20Certain%20Point%20of%20View%20Return%20of%20the%20Jedi/512jeDUHxaL.jpg"],"description":"From a Certain Point of View: Return of the Jedi (Star Wars)            Olivie Blake (Author), Saladin Ahmed (Author), Charlie Jane Anders (Author), Fran Wilde (Author), Mary Kenney (Author), & 11 more            Celebrate the lasting impact of Return of the Jedi with this exciting reimagining of the timeless Star Wars film featuring new perspectives from forty contributors.<br>            On May 25, 1983, Star Wars cemented its legacy as the greatest movie franchise of all time with the release of Return of the Jedi. In honor of its fortieth anniversary, forty storytellers re-create an iconic scene from Return of the Jedi through the eyes of a supporting character, from heroes and villains to droids and creatures. From a Certain Point of View features contributions by bestselling authors and trendsetting artists:<br>            Olivie Blake provides a chilling glimpse into the mind of Emperor Palpatine.<br>            Saladin Ahmed recounts the tragic history of the rancor trainer.<br>            Charlie Jane Anders explores the life and times of the Sarlacc.<br>            Fran Wilde reveals Mon Mothma’s secret mission to save the Rebel Alliance.<br>            Mary Kenney chronicles Wicket the Ewok’s quest for one quiet day on the forest moon of Endor.<br>            Anakin Skywalker becomes one with the Force in a gripping tale by Mike Chen.<br>            Plus more hilarious, heartbreaking, and astonishing tales from:<br>            Tom Angleberger, K Arsenault Rivera, Kristin Baver, Akemi Dawn Bowman, Emma Mieko Candon, Olivia Chadha, Gloria Chao, Adam Christopher, Paul Crilley, Amal El-Mohtar, M. K. England, Jason Fry, Adam Lance Garcia, Lamar Giles, Max Gladstone, Thea Guanzon, Ali Hazelwood, Patricia A. Jackson, Alex Jennings, Jarrett J. Krosoczka, Sarah Kuhn, Danny Lore, Sarah Glenn Marsh, Kwame Mbalia, Marieke Nijkamp, Danielle Paige, Laura Pohl, Dana Schwartz, Tara Sim, Phil Szostak, Suzanne Walker, Hannah Whitten, Sean Williams, Alyssa Wong<br>            To celebrate the launch of this book, Penguin Random House and Disney/Lucasfilm will each make donations to First Book—a leading nonprofit that provides new books, learning materials, and other essentials to educators and organizations serving children in need. In recognition of both companies’ longstanding relationships with First Book, Penguin Random House will donate at least $100,000 worth of booksto First Book and Disney/Lucasfilm will donate 100,000 children’s books to support First Book and their mission of providing equal access to quality education.<br>","quantity":6},{"bookid":"0004","name":"Ghost Tamer","author":"Meredith R. Lyons","price":6.4,"imgpath":["https://raw.githubusercontent.com/qingsen01/front_end/main/Book/Science%20Fiction%20%26%20Fantasy/Ghost%20Tamer/51HMru-6YmL.jpg"],"description":"Death is one thing, it's what you do afterward that matters.<br>            Aspiring-comedian Raely is the sole survivor of a disastrous train wreck. While faced with the intense grief of losing her best friend, she realizes that someone is following her—and has been following her all her life. Trouble is, no one else can see him. For a ghostly tag-along, Casper’s not so bad. He might even be the partner Raely needs to fight the evil spirit hell-bent on destroying her.<br>            Raely and her friend must learn why this demonic spirit is haunting Raely and how she can stop him before he destroys her life—and her soul. Which, much to her chagrin, means she needs the help of a psychic (although she’s sure they are all charlatans) and must rid herself of the pesky ghost hunter who’s interested in exploiting her new abilities.<br>            For readers who enjoy Leigh Bardugo’s Ninth House and Clay McLeod Chapman’s Ghost Eaters.","quantity":4},{"bookid":"0005","name":"Iron Flame (The Empyrean, 2)","author":"Rebecca Yarros","price":9.5,"imgpath":["https://raw.githubusercontent.com/qingsen01/front_end/main/Book/Science%20Fiction%20%26%20Fantasy/Iron%20Flame%20(The%20Empyrean%2C%202)/51CAWkTKfsL.jpg"],"description":"NOTE TO READERS: Preorder now and receive the stunning, LIMITED FIRST PRINT RUN―featuring spray-painted edges with gorgeously detailed map endpapers. This breathtaking first edition is only available for a limited time and while supplies last.<br>            \"The first year is when some of us lose our lives. The second year is when the rest of us lose our humanity.\" ―Xaden Riorson<br>            Everyone expected Violet Sorrengail to die during her first year at Basgiath War College―Violet included. But Threshing was only the first impossible test meant to weed out the weak-willed, the unworthy, and the unlucky.<br>            Now the real training begins, and Violet’s already wondering how she’ll get through. It’s not just that it’s grueling and maliciously brutal, or even that it’s designed to stretch the riders’ capacity for pain beyond endurance. It’s the new vice commandant, who’s made it his personal mission to teach Violet exactly how powerless she is–unless she betrays the man she loves.<br>            Although Violet’s body might be weaker and frailer than everyone else’s, she still has her wits―and a will of iron. And leadership is forgetting the most important lesson Basgiath has taught her: Dragon riders make their own rules.<br>            But a determination to survive won’t be enough this year.<br>            Because Violet knows the real secret hidden for centuries at Basgiath War College―and nothing, not even dragon fire, may be enough to save them in the end.<br>            The Empyrean series is best enjoyed in order.","quantity":2},{"bookid":"0006","name":"The Butler's Ghost","author":"Robert Condry","price":12.5,"imgpath":["https://raw.githubusercontent.com/qingsen01/front_end/main/Book/Science%20Fiction%20%26%20Fantasy/The%20Butler's%20Ghost/61DnH4meCCL.jpg"],"description":"A successful businessman buys his dream house for himself and his family. He should have checked the attic - the man living up there has been there for 150 years.","quantity":3},{"bookid":"0007","name":"The Death I Gave Him","author":"Em X. Liu","price":9.5,"imgpath":["https://raw.githubusercontent.com/qingsen01/front_end/main/Book/Science%20Fiction%20%26%20Fantasy/The%20Death%20I%20Gave%20Him/51VJK9ddxNL.jpg"],"description":"A TWENTY-FIRST CENTURY HAMLET<br>            Hayden Lichfield’s life is ripped apart when he finds his father murdered in their lab, and the camera logs erased. The killer can only have been after one thing: the Sisyphus Formula the two of them developed together, which might one day reverse death itself. Hoping to lure the killer into the open, Hayden steals the research. In the process, he uncovers a recording his father made in the days before his death, and a dying wish: Avenge me... and finish the Formula.<br>            And so, with no jaded British theater critic to talk to, Hayden turns to the one person who’s actually interested: a shapeshifting death goddess who happens to be his dead father’s boss. It turns out blood doesn’t mean much to the gods, but still, Hayden has no choice but to rely on the old man’s network of magical spies.<br>            The deeper he goes, the more it becomes clear that his father had involved himself in a war much bigger and more secret than Hayden ever dreamed, and that there might be more than one killer out there. For his part, Hayden’s just trying to survive his new job, ignore the apple pie in the break room, and get used to the idea that his girlfriend is dead. There are a few benefits, like all the teddy bears you can eat, but mostly, the whole thing’s a lot more trouble than it’s worth. Just ask the wizards.","quantity":7},{"bookid":"0008","name":"The Fourth Key (The Longlight Legacy, 1)","author":"Elle Katharine White","price":7.5,"imgpath":["https://raw.githubusercontent.com/qingsen01/front_end/main/Book/Science%20Fiction%20%26%20Fantasy/The%20Fourth%20Key%20(The%20Longlight%20Legacy%2C%201)/51CO8VgUHkL.jpg"],"description":"From acclaimed author Elle Katharine White comes the first full-length novel in her epic series about a fantastical world with a culture inspired by Africa, where magic rules and one misfit must discover the key to his power to save his world.<br>            The chain breaks at midnight...<br>            Miles from the magical forest of Elan, thirteen-year-old Jesse Fisher faces an almost impossible challenge: pass his Entrance Exam to enter the Academy of Magic, where every dream lives and every dreamer hopes. A victory equals a full ride. But failure leaves Jesse wishing he could vanish from a life he would rather not know. Someday, though...<br>            When Jesse meets his competition in the Entrance Exam—a cold, calculating girl named Leigh—he's in trouble. When they share the reins of a dragon steed—a beast he cannot control—he's in worse trouble. To make matters worse, a chance meeting reveals a magical prophecy that could destroy everything he ever hoped to have.<br>            To fulfill the prophecy, Jesse must become the man he never knew how to be—a man who is a threat to everything and everyone he cares about. A man who can control The Fourth Key.<br>            The Longlight Legacy is best enjoyed in order.","quantity":5},{"bookid":"0009","name":"The Hidden Girl and Other Stories","author":"Ken Liu","price":8.2,"imgpath":["https://raw.githubusercontent.com/qingsen01/front_end/main/Book/Science%20Fiction%20%26%20Fantasy/The%20Hidden%20Girl%20and%20Other%20Stories/51CO8VgUHkL.jpg"],"description":"From award-winning author Ken Liu comes his much anticipated second volume of short stories.<br>            Ken Liu is one of the most lauded short story writers of our time. This collection includes a selection of his science fiction and fantasy stories from the last five years—sixteen of his best—plus a new novelette.<br>            In addition to these seventeen selections, The Hidden Girl and Other Stories also features an excerpt from book three in the Dandelion Dynasty series, The Veiled Throne.","quantity":6},{"bookid":"0010","name":"The Hollow Ones (The Blackwood Tapes, 1)","author":"Guillermo del Toro, Chuck Hogan","price":11.7,"imgpath":["https://raw.githubusercontent.com/qingsen01/front_end/main/Book/Science%20Fiction%20%26%20Fantasy/The%20Hollow%20Ones%20(The%20Blackwood%20Tapes%2C%201)/51nOWIyts-L.jpg"],"description":"A horrific crime that defies ordinary explanation. A rookie FBI agent in dangerous, uncharted territory. An extraordinary hero for the ages. Odessa Hardwicke's life is derailed when she's forced to turn her gun on her partner, Walt Leppo, a decorated FBI agent who turns suddenly, inexplicably violent while apprehending a rampaging murderer. The shooting, justified by self-defense, shakes the young FBI agent to her core. Devasted, Odessa is placed on desk leave pending a full investigation. But what most troubles Odessa isn't the tragedy itself—it's the shadowy presence she thought she saw fleeing the deceased agent's body after his death. Questioning her future with the FBI and her sanity, Hardwicke accepts a low-level assignment to clear out the belongings of a retired agent in the New York office. What she finds there will put her on the trail of a mysterious figure named John Blackwood, a man of enormous means who claims to have been alive for centuries. Blackwood's existence and his true intentions are far more extraordinary than the facts suggest. And when Hardwicke comes across a lost literary masterpiece in the agency's old files, she unravels the greatest enigma in American literary history, and discovers a horrifying secret that threatens every man, woman, and child on Earth.","quantity":8}]